Tekla Open API Reference for Tekla Structures 2025
ContainerElement.GetEnumerator Method
 Returns an enumerator that iterates through a collection.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerator GetEnumerator()
Public Function GetEnumerator As IEnumerator
Return Value
Type: IEnumerator
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable.GetEnumerator()
See Also
Reference
ContainerElement Class
Tekla.Structures.Drawing Namespace